Revit 2027 API
FamilyParameter Methods
The FamilyParameter type exposes the following members.
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetUnitTypeId | Gets the identifier of the unit quantifying the parameter value.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
FamilyParameter Class
Autodesk.Revit.DB Namespace